#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-buqWbNJqsR6V4jJ1" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-buqWbNJqsR6V4jJ1

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 8s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.repos_cdktfprovideracme_repositorysetup_mainprotection_AC4DFF79 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovideracme_repositorysetup_mainprotection_AC4DFF79" {
        id                              = "BPR_kwDOGjygQs4B07xV"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderarchive_repositorysetup_mainprotection_FDEC5DC0 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderarchive_repositorysetup_mainprotection_FDEC5DC0" {
        id                              = "BPR_kwDOF5XTfM4B071o"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovideraws_repositorysetup_mainprotection_25266772 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovideraws_repositorysetup_mainprotection_25266772" {
        id                              = "BPR_kwDOERTEfs4B07w8"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderazuread_repositorysetup_mainprotection_36A6CDE4 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderazuread_repositorysetup_mainprotection_36A6CDE4" {
        id                              = "BPR_kwDOGGjeT84B071z"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderazurerm_repositorysetup_mainprotection_75BFED52 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderazurerm_repositorysetup_mainprotection_75BFED52" {
        id                              = "BPR_kwDOERTEbc4B07wG"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidercloudflare_repositorysetup_mainprotection_210F0D91 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidercloudflare_repositorysetup_mainprotection_210F0D91" {
        id                              = "BPR_kwDOHW2dUs4B07u_"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidercloudinit_repositorysetup_mainprotection_530AAF0B will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidercloudinit_repositorysetup_mainprotection_530AAF0B" {
        id                              = "BPR_kwDOGR9aGs4B07yM"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderdatabricks_repositorysetup_mainprotection_144746ED will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderdatabricks_repositorysetup_mainprotection_144746ED" {
        id                              = "BPR_kwDOHXpOg84B07xl"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderdatadog_repositorysetup_mainprotection_1A672349 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderdatadog_repositorysetup_mainprotection_1A672349" {
        id                              = "BPR_kwDOFkoFWc4B07wb"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderdigitalocean_repositorysetup_mainprotection_1AB26C1D will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderdigitalocean_repositorysetup_mainprotection_1AB26C1D" {
        id                              = "BPR_kwDOHKgrPc4B07yo"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderdnsimple_repositorysetup_mainprotection_F374227A will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderdnsimple_repositorysetup_mainprotection_F374227A" {
        id                              = "BPR_kwDOHvK3sc4B0708"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderdocker_repositorysetup_mainprotection_AE7E901C will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderdocker_repositorysetup_mainprotection_AE7E901C" {
        id                              = "BPR_kwDOERTQPs4B07wT"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderexternal_repositorysetup_mainprotection_CA340E08 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderexternal_repositorysetup_mainprotection_CA340E08" {
        id                              = "BPR_kwDOFQprWc4B0706"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidergithub_repositorysetup_mainprotection_9F74CAB7 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidergithub_repositorysetup_mainprotection_9F74CAB7" {
        id                              = "BPR_kwDOERTQWc4B07xC"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidergitlab_repositorysetup_mainprotection_E00FF15F will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidergitlab_repositorysetup_mainprotection_E00FF15F" {
        id                              = "BPR_kwDOHUplYs4B07uW"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidergoogle_repositorysetup_mainprotection_6BA127EB will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidergoogle_repositorysetup_mainprotection_6BA127EB" {
        id                              = "BPR_kwDOERTEdc4B07uR"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidergooglebeta_repositorysetup_mainprotection_77224D71 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidergooglebeta_repositorysetup_mainprotection_77224D71" {
        id                              = "BPR_kwDOHLN98M4B07u1"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderhashicups_repositorysetup_mainprotection_CF4F76CB will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderhashicups_repositorysetup_mainprotection_CF4F76CB" {
        id                              = "BPR_kwDOIEa4gM4B07ub"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderhelm_repositorysetup_mainprotection_621F338E will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderhelm_repositorysetup_mainprotection_621F338E" {
        id                              = "BPR_kwDOGU2VS84B071v"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderionoscloud_repositorysetup_mainprotection_E5F3E21A will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderionoscloud_repositorysetup_mainprotection_E5F3E21A" {
        id                              = "BPR_kwDOHF6eps4B07vZ"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderkubernetes_repositorysetup_mainprotection_7672EE99 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderkubernetes_repositorysetup_mainprotection_7672EE99" {
        id                              = "BPR_kwDOERTQSc4B071B"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderlocal_repositorysetup_mainprotection_37F540AB will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderlocal_repositorysetup_mainprotection_37F540AB" {
        id                              = "BPR_kwDOF5XTms4B07yw"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidernewrelic_repositorysetup_mainprotection_115951C8 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidernewrelic_repositorysetup_mainprotection_115951C8" {
        id                              = "BPR_kwDOGZRtms4B071J"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidernull_repositorysetup_mainprotection_92682ECE will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidernull_repositorysetup_mainprotection_92682ECE" {
        id                              = "BPR_kwDOERTQT84B07yg"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderokta_repositorysetup_mainprotection_1CB82DB5 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderokta_repositorysetup_mainprotection_1CB82DB5" {
        id                              = "BPR_kwDOGgYAD84B07vq"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovideropentelekomcloud_repositorysetup_mainprotection_D990AFAF will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovideropentelekomcloud_repositorysetup_mainprotection_D990AFAF" {
        id                              = "BPR_kwDOGYzNk84B070A"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderpagerduty_repositorysetup_mainprotection_C30475A3 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderpagerduty_repositorysetup_mainprotection_C30475A3" {
        id                              = "BPR_kwDOF5XTZM4B07wx"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderpostgresql_repositorysetup_mainprotection_34DB5EF6 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderpostgresql_repositorysetup_mainprotection_34DB5EF6" {
        id                              = "BPR_kwDOGR9aB84B070t"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderrandom_repositorysetup_mainprotection_F5201CB9 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderrandom_repositorysetup_mainprotection_F5201CB9" {
        id                              = "BPR_kwDOF5QYes4B070V"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidersnowflake_repositorysetup_mainprotection_381E37ED will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidersnowflake_repositorysetup_mainprotection_381E37ED" {
        id                              = "BPR_kwDOGykv-s4B07vJ"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderspotinst_repositorysetup_mainprotection_3226E569 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderspotinst_repositorysetup_mainprotection_3226E569" {
        id                              = "BPR_kwDOHUaHk84B070R"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidertemplate_repositorysetup_mainprotection_59A9A22C will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidertemplate_repositorysetup_mainprotection_59A9A22C" {
        id                              = "BPR_kwDOHfp-hc4B07xS"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidertfe_repositorysetup_mainprotection_131C01D4 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidertfe_repositorysetup_mainprotection_131C01D4" {
        id                              = "BPR_kwDOGgyoys4B07wC"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidertime_repositorysetup_mainprotection_A7571876 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidertime_repositorysetup_mainprotection_A7571876" {
        id                              = "BPR_kwDOHfp-Z84B07w1"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidertls_repositorysetup_mainprotection_745F23B8 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidertls_repositorysetup_mainprotection_745F23B8" {
        id                              = "BPR_kwDOGR5adc4B070a"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfproviderupcloud_repositorysetup_mainprotection_2651E183 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfproviderupcloud_repositorysetup_mainprotection_2651E183" {
        id                              = "BPR_kwDOHUqZHc4B07ur"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_branch_protection.repos_cdktfprovidervault_repositorysetup_mainprotection_DE037A89 will be updated in-place
  ~ resource "github_branch_protection" "repos_cdktfprovidervault_repositorysetup_mainprotection_DE037A89" {
        id                              = "BPR_kwDOHji2js4B07ue"
      ~ require_conversation_resolution = false -> true
        # (11 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # github_issue_label.cdktf-provider-acme-go_repository-setup_auto-approve-label_02F2036E will be created
  + resource "github_issue_label" "cdktf-provider-acme-go_repository-setup_auto-approve-label_02F2036E" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-acme-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-acme_repository-setup_auto-approve-label_EAE6E269 will be created
  + resource "github_issue_label" "cdktf-provider-acme_repository-setup_auto-approve-label_EAE6E269" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-acme"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-archive-go_repository-setup_auto-approve-label_97E1B30E will be created
  + resource "github_issue_label" "cdktf-provider-archive-go_repository-setup_auto-approve-label_97E1B30E" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-archive-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-archive_repository-setup_auto-approve-label_8335B0C1 will be created
  + resource "github_issue_label" "cdktf-provider-archive_repository-setup_auto-approve-label_8335B0C1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-archive"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-aws-go_repository-setup_auto-approve-label_872BDB1D will be created
  + resource "github_issue_label" "cdktf-provider-aws-go_repository-setup_auto-approve-label_872BDB1D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-aws-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-aws_repository-setup_auto-approve-label_C725AB66 will be created
  + resource "github_issue_label" "cdktf-provider-aws_repository-setup_auto-approve-label_C725AB66" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-aws"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azuread-go_repository-setup_auto-approve-label_795B4FB4 will be created
  + resource "github_issue_label" "cdktf-provider-azuread-go_repository-setup_auto-approve-label_795B4FB4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azuread-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azuread_repository-setup_auto-approve-label_A488865D will be created
  + resource "github_issue_label" "cdktf-provider-azuread_repository-setup_auto-approve-label_A488865D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azuread"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azurerm-go_repository-setup_auto-approve-label_F790DD20 will be created
  + resource "github_issue_label" "cdktf-provider-azurerm-go_repository-setup_auto-approve-label_F790DD20" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-azurerm_repository-setup_auto-approve-label_A1E7088B will be created
  + resource "github_issue_label" "cdktf-provider-azurerm_repository-setup_auto-approve-label_A1E7088B" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-cloudflare-go_repository-setup_auto-approve-label_5BD39550 will be created
  + resource "github_issue_label" "cdktf-provider-cloudflare-go_repository-setup_auto-approve-label_5BD39550" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-cloudflare-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-cloudflare_repository-setup_auto-approve-label_A53CC33C will be created
  + resource "github_issue_label" "cdktf-provider-cloudflare_repository-setup_auto-approve-label_A53CC33C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-cloudflare"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-cloudinit-go_repository-setup_auto-approve-label_E99A653C will be created
  + resource "github_issue_label" "cdktf-provider-cloudinit-go_repository-setup_auto-approve-label_E99A653C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-cloudinit-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-cloudinit_repository-setup_auto-approve-label_18A95480 will be created
  + resource "github_issue_label" "cdktf-provider-cloudinit_repository-setup_auto-approve-label_18A95480" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-cloudinit"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-databricks-go_repository-setup_auto-approve-label_FDABAADB will be created
  + resource "github_issue_label" "cdktf-provider-databricks-go_repository-setup_auto-approve-label_FDABAADB" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-databricks-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-databricks_repository-setup_auto-approve-label_DF56523F will be created
  + resource "github_issue_label" "cdktf-provider-databricks_repository-setup_auto-approve-label_DF56523F" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-databricks"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-datadog-go_repository-setup_auto-approve-label_7889C221 will be created
  + resource "github_issue_label" "cdktf-provider-datadog-go_repository-setup_auto-approve-label_7889C221" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-datadog-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-datadog_repository-setup_auto-approve-label_573BE0A1 will be created
  + resource "github_issue_label" "cdktf-provider-datadog_repository-setup_auto-approve-label_573BE0A1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-datadog"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-digitalocean-go_repository-setup_auto-approve-label_8CAF4864 will be created
  + resource "github_issue_label" "cdktf-provider-digitalocean-go_repository-setup_auto-approve-label_8CAF4864" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-digitalocean-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-digitalocean_repository-setup_auto-approve-label_B346F039 will be created
  + resource "github_issue_label" "cdktf-provider-digitalocean_repository-setup_auto-approve-label_B346F039" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-digitalocean"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dnsimple-go_repository-setup_auto-approve-label_01D22210 will be created
  + resource "github_issue_label" "cdktf-provider-dnsimple-go_repository-setup_auto-approve-label_01D22210" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dnsimple-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-dnsimple_repository-setup_auto-approve-label_0DE559F9 will be created
  + resource "github_issue_label" "cdktf-provider-dnsimple_repository-setup_auto-approve-label_0DE559F9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-dnsimple"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-docker-go_repository-setup_auto-approve-label_072D1B97 will be created
  + resource "github_issue_label" "cdktf-provider-docker-go_repository-setup_auto-approve-label_072D1B97" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-docker-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-docker_repository-setup_auto-approve-label_D012A3EF will be created
  + resource "github_issue_label" "cdktf-provider-docker_repository-setup_auto-approve-label_D012A3EF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-docker"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-external-go_repository-setup_auto-approve-label_1002C5DC will be created
  + resource "github_issue_label" "cdktf-provider-external-go_repository-setup_auto-approve-label_1002C5DC" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-external-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-external_repository-setup_auto-approve-label_08E43582 will be created
  + resource "github_issue_label" "cdktf-provider-external_repository-setup_auto-approve-label_08E43582" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-external"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-github-go_repository-setup_auto-approve-label_A5963C91 will be created
  + resource "github_issue_label" "cdktf-provider-github-go_repository-setup_auto-approve-label_A5963C91" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-github-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-github_repository-setup_auto-approve-label_0F631DE0 will be created
  + resource "github_issue_label" "cdktf-provider-github_repository-setup_auto-approve-label_0F631DE0" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-github"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-gitlab-go_repository-setup_auto-approve-label_218B96D1 will be created
  + resource "github_issue_label" "cdktf-provider-gitlab-go_repository-setup_auto-approve-label_218B96D1" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-gitlab-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-gitlab_repository-setup_auto-approve-label_9EE6B2FC will be created
  + resource "github_issue_label" "cdktf-provider-gitlab_repository-setup_auto-approve-label_9EE6B2FC" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-gitlab"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-google-go_repository-setup_auto-approve-label_5D9530FD will be created
  + resource "github_issue_label" "cdktf-provider-google-go_repository-setup_auto-approve-label_5D9530FD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-google-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-google_repository-setup_auto-approve-label_7151E72D will be created
  + resource "github_issue_label" "cdktf-provider-google_repository-setup_auto-approve-label_7151E72D" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-google"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-googlebeta-go_repository-setup_auto-approve-label_486DF896 will be created
  + resource "github_issue_label" "cdktf-provider-googlebeta-go_repository-setup_auto-approve-label_486DF896" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googlebeta-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-googlebeta_repository-setup_auto-approve-label_007D7C98 will be created
  + resource "github_issue_label" "cdktf-provider-googlebeta_repository-setup_auto-approve-label_007D7C98" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-googlebeta"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hashicups-go_repository-setup_auto-approve-label_28B841B9 will be created
  + resource "github_issue_label" "cdktf-provider-hashicups-go_repository-setup_auto-approve-label_28B841B9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hashicups-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-hashicups_repository-setup_auto-approve-label_808933F5 will be created
  + resource "github_issue_label" "cdktf-provider-hashicups_repository-setup_auto-approve-label_808933F5" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-hashicups"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-helm-go_repository-setup_auto-approve-label_CDFEDB0F will be created
  + resource "github_issue_label" "cdktf-provider-helm-go_repository-setup_auto-approve-label_CDFEDB0F" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-helm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-helm_repository-setup_auto-approve-label_B12F5DF4 will be created
  + resource "github_issue_label" "cdktf-provider-helm_repository-setup_auto-approve-label_B12F5DF4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-helm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-ionoscloud-go_repository-setup_auto-approve-label_559AC997 will be created
  + resource "github_issue_label" "cdktf-provider-ionoscloud-go_repository-setup_auto-approve-label_559AC997" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ionoscloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-ionoscloud_repository-setup_auto-approve-label_69868016 will be created
  + resource "github_issue_label" "cdktf-provider-ionoscloud_repository-setup_auto-approve-label_69868016" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-ionoscloud"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-kubernetes-go_repository-setup_auto-approve-label_E27D905B will be created
  + resource "github_issue_label" "cdktf-provider-kubernetes-go_repository-setup_auto-approve-label_E27D905B" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-kubernetes-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-kubernetes_repository-setup_auto-approve-label_2D557777 will be created
  + resource "github_issue_label" "cdktf-provider-kubernetes_repository-setup_auto-approve-label_2D557777" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-kubernetes"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local-go_repository-setup_auto-approve-label_0767D377 will be created
  + resource "github_issue_label" "cdktf-provider-local-go_repository-setup_auto-approve-label_0767D377" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-local-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-local_repository-setup_auto-approve-label_494C4887 will be created
  + resource "github_issue_label" "cdktf-provider-local_repository-setup_auto-approve-label_494C4887" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-local"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-newrelic-go_repository-setup_auto-approve-label_8508877C will be created
  + resource "github_issue_label" "cdktf-provider-newrelic-go_repository-setup_auto-approve-label_8508877C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-newrelic-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-newrelic_repository-setup_auto-approve-label_FB036E82 will be created
  + resource "github_issue_label" "cdktf-provider-newrelic_repository-setup_auto-approve-label_FB036E82" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-newrelic"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-null-go_repository-setup_auto-approve-label_8C386D2C will be created
  + resource "github_issue_label" "cdktf-provider-null-go_repository-setup_auto-approve-label_8C386D2C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-null-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-null_repository-setup_auto-approve-label_0506E4B9 will be created
  + resource "github_issue_label" "cdktf-provider-null_repository-setup_auto-approve-label_0506E4B9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-null"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-okta-go_repository-setup_auto-approve-label_E159D665 will be created
  + resource "github_issue_label" "cdktf-provider-okta-go_repository-setup_auto-approve-label_E159D665" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-okta-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-okta_repository-setup_auto-approve-label_386EC761 will be created
  + resource "github_issue_label" "cdktf-provider-okta_repository-setup_auto-approve-label_386EC761" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-okta"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-opentelekomcloud-go_repository-setup_auto-approve-label_18B5F12E will be created
  + resource "github_issue_label" "cdktf-provider-opentelekomcloud-go_repository-setup_auto-approve-label_18B5F12E" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opentelekomcloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-opentelekomcloud_repository-setup_auto-approve-label_EB8EF957 will be created
  + resource "github_issue_label" "cdktf-provider-opentelekomcloud_repository-setup_auto-approve-label_EB8EF957" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-opentelekomcloud"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-pagerduty-go_repository-setup_auto-approve-label_1C665EF9 will be created
  + resource "github_issue_label" "cdktf-provider-pagerduty-go_repository-setup_auto-approve-label_1C665EF9" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-pagerduty-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-pagerduty_repository-setup_auto-approve-label_66D7B284 will be created
  + resource "github_issue_label" "cdktf-provider-pagerduty_repository-setup_auto-approve-label_66D7B284" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-pagerduty"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-postgresql-go_repository-setup_auto-approve-label_7A46CA10 will be created
  + resource "github_issue_label" "cdktf-provider-postgresql-go_repository-setup_auto-approve-label_7A46CA10" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-postgresql-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-postgresql_repository-setup_auto-approve-label_9CE52643 will be created
  + resource "github_issue_label" "cdktf-provider-postgresql_repository-setup_auto-approve-label_9CE52643" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-postgresql"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-project_repository-setup_auto-approve-label_A1B2ECAC will be created
  + resource "github_issue_label" "cdktf-provider-project_repository-setup_auto-approve-label_A1B2ECAC" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-project"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-random-go_repository-setup_auto-approve-label_EE973476 will be created
  + resource "github_issue_label" "cdktf-provider-random-go_repository-setup_auto-approve-label_EE973476" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-random-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-random_repository-setup_auto-approve-label_C02B56B6 will be created
  + resource "github_issue_label" "cdktf-provider-random_repository-setup_auto-approve-label_C02B56B6" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-random"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-snowflake-go_repository-setup_auto-approve-label_02822E9C will be created
  + resource "github_issue_label" "cdktf-provider-snowflake-go_repository-setup_auto-approve-label_02822E9C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-snowflake-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-snowflake_repository-setup_auto-approve-label_B9A66AB0 will be created
  + resource "github_issue_label" "cdktf-provider-snowflake_repository-setup_auto-approve-label_B9A66AB0" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-snowflake"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-spotinst-go_repository-setup_auto-approve-label_85EDF0FE will be created
  + resource "github_issue_label" "cdktf-provider-spotinst-go_repository-setup_auto-approve-label_85EDF0FE" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-spotinst-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-spotinst_repository-setup_auto-approve-label_A3728D69 will be created
  + resource "github_issue_label" "cdktf-provider-spotinst_repository-setup_auto-approve-label_A3728D69" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-spotinst"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-template-go_repository-setup_auto-approve-label_997A2399 will be created
  + resource "github_issue_label" "cdktf-provider-template-go_repository-setup_auto-approve-label_997A2399" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-template-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-template_repository-setup_auto-approve-label_22B20874 will be created
  + resource "github_issue_label" "cdktf-provider-template_repository-setup_auto-approve-label_22B20874" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-template"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-tfe-go_repository-setup_auto-approve-label_D65B322E will be created
  + resource "github_issue_label" "cdktf-provider-tfe-go_repository-setup_auto-approve-label_D65B322E" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-tfe-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-tfe_repository-setup_auto-approve-label_71077F85 will be created
  + resource "github_issue_label" "cdktf-provider-tfe_repository-setup_auto-approve-label_71077F85" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-tfe"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-time-go_repository-setup_auto-approve-label_9F2741DE will be created
  + resource "github_issue_label" "cdktf-provider-time-go_repository-setup_auto-approve-label_9F2741DE" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-time-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-time_repository-setup_auto-approve-label_AFB977C2 will be created
  + resource "github_issue_label" "cdktf-provider-time_repository-setup_auto-approve-label_AFB977C2" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-time"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-tls-go_repository-setup_auto-approve-label_41B17BBF will be created
  + resource "github_issue_label" "cdktf-provider-tls-go_repository-setup_auto-approve-label_41B17BBF" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-tls-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-tls_repository-setup_auto-approve-label_D78188BD will be created
  + resource "github_issue_label" "cdktf-provider-tls_repository-setup_auto-approve-label_D78188BD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-tls"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-upcloud-go_repository-setup_auto-approve-label_3EF8EC07 will be created
  + resource "github_issue_label" "cdktf-provider-upcloud-go_repository-setup_auto-approve-label_3EF8EC07" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-upcloud-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-upcloud_repository-setup_auto-approve-label_5C8847AD will be created
  + resource "github_issue_label" "cdktf-provider-upcloud_repository-setup_auto-approve-label_5C8847AD" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-upcloud"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-vault-go_repository-setup_auto-approve-label_DCFB19E5 will be created
  + resource "github_issue_label" "cdktf-provider-vault-go_repository-setup_auto-approve-label_DCFB19E5" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vault-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-provider-vault_repository-setup_auto-approve-label_7D0FCA1C will be created
  + resource "github_issue_label" "cdktf-provider-vault_repository-setup_auto-approve-label_7D0FCA1C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-provider-vault"
      + url        = (known after apply)
    }

  # github_issue_label.cdktf-repository-manager_repository-setup_auto-approve-label_F8DAAE17 will be created
  + resource "github_issue_label" "cdktf-repository-manager_repository-setup_auto-approve-label_F8DAAE17" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktf-repository-manager"
      + url        = (known after apply)
    }

  # github_repository.repos_cdktfprovideracme_repo_DD1AA41F will be updated in-place
  ~ resource "github_repository" "repos_cdktfprovideracme_repo_DD1AA41F" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-acme"
        name                        = "cdktf-provider-acme"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos_cdktfprovideracmego_repo_B75411DA will be updated in-place
  ~ resource "github_repository" "repos_cdktfprovideracmego_repo_B75411DA" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-acme-go"
        name                        = "cdktf-provider-acme-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos_cdktfproviderarchive_repo_F28A4A49 will be updated in-place
  ~ resource "github_repository" "repos_cdktfproviderarchive_repo_F28A4A49" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-archive"
        name                        = "cdktf-provider-archive"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos_cdktfproviderarchivego_repo_2ED18192 will be updated in-place
  ~ resource "github_repository" "repos_cdktfproviderarchivego_repo_2ED18192" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-archive-go"
        name                        = "cdktf-provider-archive-go"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos_cdktfprovideraws_repo_55F46B23 will be updated in-place
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-aws"
        name                        = "cdktf-provider-aws"
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository.repos_cdktfproviderawsgo_repo_AE367E97 will be updated in-place
  ~ resource "github_repository" "repos_cdktfproviderawsgo_repo_AE367E97" {
      ~ allow_auto_merge            = false -> true
      ~ allow_update_branch         = false -> true
        id                          = "cdktf-provider-aws-go"
        name                        = "cdktf-provider-aws-go"
      ~ squa...
```

</details>

*Pusher: @xiehan, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*